#!/usr/bin/env python

# задание 6

"""
Дана строка. Замените в этой строке все цифры 1 на слово one.

"""

stroka = 'Hello, world 1 1 1!'
print('Замена на one = ', stroka.replace('1', 'one'))
