#!/usr/bin/env python

# задание 6

"""
Дана строка. Удалите из этой строки все символы @.
"""

stroka = 'Hello@, world @ @!'
print('Замена на one = ', stroka.replace('@', ''))
